app/Controllers/Main.php

SELECT *
FROM `guest`
WHERE `nicknameGuest` = 'amilatul-077'
 LIMIT 1
---
    public function Invitation($nick){
        helper(['url']);
        $tamuModel = new TamuModel();
        $tamu = $tamuModel->where('nicknameGuest', $nick)->first();