app/Controllers/Page.php

SELECT *
FROM `guest`
WHERE `nicknameGuest` = 'diky-207'
 LIMIT 1
---
    public function Undangan($nickname){
        helper(['url']);
        $tamuModel = new TamuModel();
        $tamu = $tamuModel->where('nicknameGuest', $nickname)->first();