app/Models/KehadiranModel.php

INSERT INTO `kehadiran` (`idGuest`, `statusKehadiran`, `pesan`) VALUES ('26', 'YA', 'selamaatttt')
---
    function add($data){
        return $this->db
        ->table($this->table)
        ->insert($data);